aircond_rails_app/app/views/phone_apps/_phone_app.html.erb

SELECT "phone_apps".* FROM "phone_apps" WHERE "phone_apps"."status" = $1 ORDER BY "phone_apps"."id" ASC  [["status", 1]]
---
    <%= form_for phone_app, url:approve_token_path(phone_app.id) do |f|%>
      <%= f.select :status, PhoneApp.statuses.keys%>