aircond_rails_app/app/controllers/airconds_controller.rb

	def create
		device= Device.new(device_params)
		if device.save
			ac = Aircond.new(device_id:device.id,alias:aircond_params[:alias])
			ac.save
---
INSERT INTO "devices" ("url", "access_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "http://ag8nextacademy.ddns.net:9006"], ["access_token", "4b9e9caa0fc528016cca772ecc0d4655"], ["created_at", 2017-02-08 03:21:55 UTC], ["updated_at", 2017-02-08 03:21:55 UTC]]
INSERT INTO "airconds" ("device_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["device_id", 4], ["created_at", 2017-02-08 03:21:56 UTC], ["updated_at", 2017-02-08 03:21:56 UTC]]

	def update
			@current_timer = Time.zone.parse(@aircond.timer.to_s)
			@current_time= Time.zone.now
			@aircond.update(alias:aircond_params[:alias]) if aircond_params.keys.include? "alias"
---
UPDATE "airconds" SET "mode" = $1, "fan_speed" = $2, "temperature" = $3, "updated_at" = $4 WHERE "airconds"."id" = $5  [["mode", 2], ["fan_speed", 1], ["temperature", 24], ["updated_at", 2017-01-24 04:52:22 UTC], ["id", 1]]

	def set_all_status
		#sets all the aircond statuses..
		ac_grp = AircondGroup.find_by_title(params[:aircond][:group_title])
		ac_grp.nil? ? @airconds = Aircond.all : @airconds = ac_grp.airconds

		@airconds.each do |ac|
			# ac.send_signal(params[:status]) if ac.get_state[:status] != params[:status]
			# ac.update(status:ac.get_state[:status])
			ac.update(status:params[:status])
		end

		flash[:warning] = "Airconds with aliases  #{Aircond.where('status != ?', Aircond.statuses[params[:status]]).pluck(:alias)} were not successfully #{params[:status]}"
---
SELECT  "airconds".* FROM "airconds" ORDER BY "airconds"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "airconds"."alias" FROM "airconds" WHERE (status != 1)

	def app_set
		PaperTrail.whodunnit = params[:user_name]
		if validate_app_token(params[:user_name],params[:app_token])
			cmd = decipher_command(aircond_params)
			if validate_AC_controls(cmd)
				if @aircond.check_device_status
					if @aircond.check_power_status(aircond_params['status'])
						@aircond.update(aircond_params)
---
UPDATE "airconds" SET "status" = $1, "mode" = $2, "fan_speed" = $3, "temperature" = $4, "updated_at" = $5 WHERE "airconds"."id" = $6  [["status", 1], ["mode", 2], ["fan_speed", 2], ["temperature", 21], ["updated_at", 2017-01-31 08:09:15 UTC], ["id", 1]]

	def update_website_from_firebase
		PaperTrail.whodunnit = 'firebase'
		arguments = aircond_params
		sanitize_params(arguments)

		Aircond.set_callback(:update,:before,:check_state)
		Aircond.set_callback(:save,:after, :update_firebase)
		Aircond.skip_callback(:update,:before,:check_state)
		Aircond.skip_callback(:save,:after, :update_firebase)
		@aircond.update(arguments)
---
UPDATE "airconds" SET "temperature" = $1, "updated_at" = $2 WHERE "airconds"."id" = $3  [["temperature", 0], ["updated_at", 2017-01-31 08:31:42 UTC], ["id", 1]]

	def set_aircond
		@aircond = Aircond.find(params[:id])
---
SELECT  "airconds".* FROM "airconds" WHERE "airconds"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]