aircond_rails_app/app/controllers/phone_apps_controller.rb

INSERT INTO "phone_apps" ("created_at", "updated_at", "user_name", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", 2017-01-20 03:54:11 UTC], ["updated_at", 2017-01-20 03:54:11 UTC], ["user_name", "name"], ["password_digest", "$2a$10$l2/WsYVp2Oyc/1Y6lWZvYO79UMwuh.2D.5zYzCIFcbxBa92eKSJny"]]
---
	def create
		phone_app=PhoneApp.new(phone_app_params)
		if phone_app.save

SELECT "phone_apps".* FROM "phone_apps" ORDER BY "phone_apps"."id" ASC
SELECT "phone_apps".* FROM "phone_apps" WHERE "phone_apps"."status" = $1 ORDER BY "phone_apps"."id" ASC  [["status", 1]]
---
	def index
		if is_admin?
			@current_time = Time.zone.now
			if params[:filter] == nil || params[:filter] == "ALL"
				@phone_apps = PhoneApp.all.order(:id)
			else
				@phone_apps = PhoneApp.filter_by_status(params[:filter]).order(:id)

SELECT  "phone_apps".* FROM "phone_apps" WHERE "phone_apps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "phone_apps" SET "status" = $1, "updated_at" = $2 WHERE "phone_apps"."id" = $3  [["status", 1], ["updated_at", 2017-01-19 06:05:04 UTC], ["id", 1]]
---
	def approve_token
		@phone_app = PhoneApp.find(params[:id])
		if is_admin?
			@phone_app.update(status:params[:phone_app][:status])

SELECT  "phone_apps".* FROM "phone_apps" WHERE "phone_apps"."user_name" = $1 LIMIT $2  [["user_name", "name3"], ["LIMIT", 1]]
UPDATE "phone_apps" SET "access_token" = $1, "updated_at" = $2 WHERE "phone_apps"."id" = $3  [["access_token", "01ea247c92b26eef9907513d43d434d7"], ["updated_at", 2017-01-20 08:55:50 UTC], ["id", 4]]
---
	def provide_token
		phone_app = PhoneApp.find_by(user_name:params[:user_name])
		phone_app = phone_app.authenticate(params[:password]) if !phone_app.nil?
		if phone_app
			if phone_app.status == 'ACCEPTED'
				phone_app.update(access_token:generate_security_token)

SELECT  "phone_apps".* FROM "phone_apps" WHERE "phone_apps"."user_name" = $1 LIMIT $2  [["user_name", "name"], ["LIMIT", 1]]
---
	def check_token
		phone_app = PhoneApp.find_by(user_name:params[:user_name])