aircond_rails_app/app/controllers/users_controller.rb

	def dashboard
		Time.zone = current_user.timezone
		@current_time = Time.zone.now
		@airconds = Aircond.all.order(:id)
---
SELECT "airconds".* FROM "airconds" ORDER BY "airconds"."id" ASC

	def timeset
		current_user.timezone = params.permit![:user][:timezone]
		current_user.save
---
UPDATE "users" SET "timezone" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["timezone", "Singapore"], ["updated_at", 2017-01-20 07:11:29 UTC], ["id", 1]]